//
//  LifeCode.swift
//  LifeCode
//
//  Created by MEI KU on 2017/10/4.
//  Copyright © 2017年 Natalie KU. All rights reserved.
//

import Foundation
enum LifeCode {
    case one,two,three,four,five,six,seven,eight,nine
    
    var status: String {
        switch self {
        case .one:
            return """
            生命數字1的人的性格:
            生命靈數1的人的個性非常的自我而且強烈。做什麼事，總是以自己的想法出發。這樣的個性很適合做一個領導者，因為你可以領導別人往目標邁進，你像一個戰士一樣，不畏挑戰不怕困難，也不怕別人與你衝突，帶著很強烈的征服慾，這樣的開創性格，讓你可以完成不可能的任務，而且一旦決定目標，幾乎可以排除萬難的把你的理想落實。
            
            生命數字1的人的缺點:
            不過這樣的個性也會有很大的缺點，比方說，你不能站在別人的角度他人著想，有時緦是一意孤行，不顧別人反對，而且好勝心強、固執且本位主義太強，常讓你與他人很難協調。有時候，自尊心太強，會讓你往往拉不下臉來，自信心不夠，卻又要擺出一副很了不起的姿態，往往得罪很多人。基本上你需要學習柔軟的身段，並學會站在別人的角度，聆聽別人的意見。
            
            生命數字1的人的愛情:
            你常常不懂得如何與另一半溝通。剛開始追求的時候，非常的積極而熱情，但開始交往之後，卻常常不懂另一半的心，或者一昧的要求另一半配合你取悅你，也不太願為對方改變。所以如果你的另一半是配合度比較高的，而你也能或多或少為對方著想的話，就可以相處甚歡，如果對方也很主觀，那你的戀愛就成了一個每天吵個不停的戰場。
            
            生命數字1的人的職業:
            你的熱情、幹勁、及侵略性，讓你很適合做業務性質的工作。你的工作如果需要有很強的開拓性，你就能做的很好。業務員、企業家、很特立獨行的藝術家、主管或自行創業等等。
            """
        case .two:
            return """
            生命數字2的人的性格:
            你的個性有一個很大的特點，就是你非常重視人際關係，而且當別人愉快的時候，你也會覺得很開心。所以你很體貼，很溫和，不喜歡與人爭，非常的善解人意。在與別人相處的時候，常為他人設想，在乎別人的感覺，也重視別人的意見，也很在意他人的批評，常常都想要做到面面俱到，是一個渾然天成的公關高手，擅長處理人際關係，抗壓性強，身段也很柔軟。能帶給身邊的人幸福。
            
            生命數字2的人的缺點:
            太在乎人際關係，會讓你很容易受到別人的影響，不想辜負別人的期望，常常把自己搞的很累。有時猶豫不決，拿不定主意，也讓身旁的人很火大。常常自己的生活，自己的工作，會受到別人的左右，而不能朝向自己的目標前進，搞的自己進退兩難。當你把別人對你的期待擺在第一順位，而忽略自己內在的渴望時，你會很痛苦很生氣，然後讓自己變成受害者，這是很需要去避免的。
            
            生命數字2的人的愛情:
            你很依賴，很需要有一個人在你的身邊。所以當你單身的時候，你會一直想要找到一個伴，不然就會覺得沒有安全感。當你有另一半的時候，你是個很貼心的情人，凡事都替另一半著想，另一半一定會覺得很幸福。只不過，如果你的另一半不是同樣貼心的人，甚至對你予取予求，你的生活就會跟著他一團亂，所以找一個同時能為你著想的另一半是很重要的。
            
            生命數字2的人的職業:
            你非常的擅長處理人際關係，所以服務業很適合你。所有那一種需要很溫暖的去照顧別人的需求的工作，都很適你。比如飯店業、公關業、客服等等之類的行業。當然你也適合做照顧別人的工作，如保姆、看護人員等等。在公司裡頭，你所奉行的是老二哲學，不喜歡強出頭，所以你的工作多半是後勤支援與幕僚的角色。
            """
        case .three:
            return """
            
            生命數字3的人的性格:
            你是個很聰明，而且點子很多的人！溝通表達能力都很強，而且個性上喜歡嚐試新鮮的事物，腦子裡裝了很多稀奇古怪的念頭；你同時很喜歡交朋友，很喜歡那一種大家一起聊天八卦的感覺。所以你在一個團體裡，總顯得很活躍，很惹人注目。你也喜歡在大家面前發表你自己的想法，別人也常常把你當軍師，遇到疑難雜症，就會來找你想辨法，是不折不扣的意見領袖。
            
            生命數字3的人的缺點:
            喜歡新事物，討厭一成不變，有時會讓你覺得你很善變。早上的想法與下午的想法可能完全不一樣，雖然你自有一套說法可以自圓其說，但別人總會覺得你有一點前後不一。你還需要注意的是，說了就要做到，不要光靠一張嘴，不然別人也會覺得你是一個只會說卻不會做的人。你還要小心的不要去討論別人的八卦是非，否則你就會常常遇到那種朋友間相互猜忌互有心結的情況。
            
            生命數字3的人的愛情:
            你有發現你自己喜歡朋友更甚於喜歡談戀愛嗎?或許，應該要說兩個人的世界，一旦穩定下來，而變得一成不變的時候，你就會開始覺得無聊。而且朋友很多的你，因為認識異性的機會也多，所以有時候你會發現自己一不小心，就會陷入和人搞曖昧的情況哦！沒錯，生命數字3的人，有時會讓人覺得有點花心哦！所以你的另一半如果和你有一群共同的朋友，你就不用在朋友和戀愛間取捨了。
            
            生命數字3的人的職業:
            聰明而且點子多是你的特色！還可以口沫橫飛的去把你自己的想法活靈活現的傳達給別人是你的專長。所以你很適合做大眾傳播的工作，如記者、廣告或行銷企劃等，創意有關的工作。而且口才很好的你，也適合做講師、訓練師、或者企業對外的發言人之類的角色；另外，點子很多的你，也適合做一些創新研發的工作。
            """
            
        case.four:
            return"""
            生命數字4的人的性格:
            想像一個四邊形，那種方方正正的感覺，就是生命數字 4的你的特色啦。個性規規矩矩，有條有理。務實踏實是你的優點，只做有把握的事，對於太冒險的事，通常都會感到害怕而不願輕易嚐試。生命靈數4的你，是個不折扣不扣的保守派！最想要的就是房子，因為房子能帶來安全感。真的，生命數字4的人，一直在追求的都是安全感。賺錢踏踏實實，一點都不投機，花錢也精打細算，絕不會花的比賺的多。
            
            生命數字4的人的缺點:
            生命靈數四的人，最大的問題就是太固執太保守，不敢輕易嚐試新事物。所以，就算你很有野心，想要做很大的事業，想要買很大的房子，想要存很多錢，可是你卻太保守，而沒有辨法勇敢的踏出去，所以生命數字4的你，學著更勇敢更積極是有必要的。至於這種害怕改變的心情，主要是因為你老是比較負面思考，所以你要學著正向積極，多往好的方面想，才不會老搬石頭砸自己的腳。
            
            生命數字4的人的愛情:
            生命靈數4的人，在談戀愛的部份是比較保守而務實的。簡單的來說，你找伴侶也希望另一半的財務狀況能夠穩定。所以，女生通常會希望另一半在金錢上可以提供安全感，男生則是顧家型的男人，談戀愛的時候，通常會以結婚為前提。所以你可能會為了經濟的穩定嫁給一個你不是很愛的人，而不敢去追求自己的真愛。不過你很擅長理財理家，結婚後可以過著穩定的生活。
            
            生命數字4的人的職業:
            穩定而按步就班是你的特色！所以生命數字4的人，通常也有穩健管理與經營 的能力。像店長、廠長這種中階主管，逐步的把上司交代的工作完成是很適合你的。如果你數字能力很好，你也可以做會計之類的工作。通常你也會對房地產有興趣，所以建築、室內設計或房地產買賣或建材買賣都適合你的調性。
            """

        case.five:
            return """
            生命數字5的人的性格:
            特立獨行的你，喜歡自由，喜歡冒險，不喜歡被約束！你的個性比較我行我素，喜歡交朋友，喜歡嚐試新鮮不一樣的事物，喜歡跟人家不一樣，也不害怕標新立異。不喜歡迂腐、八股、權威及守舊的人事物，有種叛逆的特質，總想要顛覆傳統，抗拒束縛。所以你是一個革新派，是一個冒險家，是一個鬥士，不容許有人限制了你的自由，干涉你的自由意志。
            
            生命數字5的人的缺點:
            尋求刺激，沒定性是你一個很大的問題，你有點喜新厭舊，不太喜歡做一成不變的事，所以一般朝九晚五的工作你總是很容易感到無聊，也許會一直換工作，給人不穩定的感覺；而且一旦感覺到不合理，你的好鬥好爭辯的個性就會跑出來，過度堅持自己的理念與意見，不惜與人爭吵，不佔得上風不肯罷休，需要學習更圓融的處理人際關係。
            
            生命數字5的人的愛情:
            你的愛情猛烈又快速，常有一見鍾情的感覺，一旦愛上了就瘋狂追求，卻常常只有五分鐘熱度，一旦成功了，卻又只有五分鐘的熱度！而且不喜歡受限制的你，一旦覺得無聊，就想拔腿就跑！很難給出一對一的承諾！所以，你的愛情觀是遊戲人間的，所以你大可多談幾段戀愛，等到你玩夠了，再來考慮想定下來。
            
            生命數字5的人的職業:
            不喜歡被約束的你，適合自由業！自己當自己的老闆！工作類型上，適合變化多端不會無聊的工作！所以，擁有專業的技術或可以謀生的才華，對你而言是很重要的。比如說可以儘情展現自己魅力的演藝人員、藝術家、設計工作者都適合你。另外，可以四處跑來跑去的，比如說導遊、業務員都適合你。
            """
            
        case.six:
            return """
            生命數字6的人的性格:
            你的個性很溫和而有愛心。喜歡照顧別人，服務別人。而且很有同情心，一旦看到有人受苦，你都會有一種想要去幫助他們的慈悲心。你常常為身邊的人犧牲奉獻，在日常生活上去照顧別人，這樣的特質，有點像人間天使。另外，你是一個很重視細節的人，很細心很細膩，很擅長處理複雜而繁瑣的事，而且有種完義主義的傾向。
            
            生命數字6的人的缺點:
            為他人無條件的犧牲奉獻讓你很開心，但是如果超出了自己的能力範圍，常常也會把自己搞的一團亂，也只會讓他人無法獨立，而你也會有一種不公平的感覺，覺得自己為別人做了那麼多，卻沒有得到回報，而產生抱怨與嘮叨的傾向。另外，你的完美主義，也會讓你對很小事吹毛求疪，一邊做一邊碎碎唸，一邊覺得不滿意，都會讓身邊的人受不了。
            
            生命數字6的人的愛情:
            為情人洗衣煮飯，打點生活上的大大小小細節是常會做的事。所以，當你的另一半 還真是幸福啊！但是你要記住﹂歡喜做乾願受」，可不要老是抱怨為什麼另一半沒法子用同樣的方法回報你？而且你要注意，可不要把愛情與同情混一談啊！不然你就總是會遇見一塌糊塗的可憐蟲情人，讓你在財務上生活上為他擔心受怕。如果慎選一個負責的好對象，你的感情生活就會平安而富足哦。
            
            生命數字6的人的職業:
            注重細節的特質，讓你可以處理多複雜而細膩的事，所以總務、行政、會計工作都適合你。你或許會對醫療工作也有興趣，所以醫生、護士、醫藥方面的工作也適合你。有很多生命數字6的朋友，也會投身在非營利組織中，為了自己的一份愛與理想而付出。一些照顧服務性的工作，如托兒所、社工、或服務業都適合你的個性。
            """
            
        case.seven:
            return """
            生命數字7的人的性格:
            你天生有種理性、擅長分析的特質，對很多事都抱著懷疑的態度，喜歡學習、學歡閱讀，有種與生俱來的智慧。你很聰明，很有自己的想法，常常是朋友的智囊團，因為你總是有辨法很理性很超然的去分析一個情境，然後提出你自己的看法及建議別人一個有效的辨法。你也喜歡挑戰不可能，對你而言愈難的事，你愈是要想辨法去把它弄個清楚，是個道道地地的評論家與分析師。
            
            生命數字7的人的缺點:
            對很多事都產生質疑，不容易相信是你一個很大的問題。因為對人事物的存疑，所以你總是會感到自己有一種焦慮與不信任的感覺。有時流於理性與太愛分析，很多事對你而言，會顯得醜陋而冷酷。因為對很多事都看得很透徹，反而有時會讓你不相信人性，甚至選擇逃避與遠離人群，過著一種孤芳自賞的生活。
            
            生命數字7的人的愛情:
            對人的質疑與不信任，讓你和你的另一半好像總有道透明的牆。他會愛我一輩子嗎?他會只愛我嗎?他真的適合我嗎?你的心裡永遠有問不完的問題！而且太過聰明的你，總很輕易就會找到對方的缺點，讓好不容易點著的熱情，瞬間澆了一盆冷水！所以囉，你的另一半在心智上能和你溝通，能和你討論你的想法你的見地是很重要的，唯有如此，你們的愛才能愈談愈深刻。
            
            生命數字7的人的職業:
            擅長分析的你，有辨法把複雜的現像系統化，所以像分析師、工程師、市場研究員或財務分析師之類的工作都適合你。有些生命數字7的朋友，對宗教靈性的事物充滿興趣，可也可擔任命理諮商師、心理治療師之類的角色。因為很有自己的看法與主見，所以可以從事如出版或寫作之類的工作。
            """
            
        case.eight:
            return """
            生命數字8的人的性格:
            你是一個非常「物質」與成功導向的人。對你而言，賺取財富與贏取名聲是很重要的。而為了要達到目的，你也會展現出很多的手腕與控制力，去讓你的目標達成，所以往往會給人家一種「強人」感覺。你天生就有一種大老闆的氣度，可以果決的去做決策，與支配你身邊的資源。對你而言，沒有什麼比做生意、結交成功人士、創造富足的生活更重要，而這一切的努力，也會讓你能享有財富地位。
            
            生命數字8的人的缺點:
            太過利益導向有時會讓人家覺得你很現實，但是一旦你了解當你幫別人致富會讓你更富有時，你才不會老是按照別人的身家與存款數字來論斷別人。另外，個性上那種自以為是，愛炫耀自己的財富的個性也需要被修正； 追求財富沒有不對，但是你常常會重視物質而忽略心靈上的需求，讓人覺得你是個膚淺而世儈的人。
            
            生命數字8的人的愛情:
            你常藉由大方的送禮，物質的饋贈來表現自己的能耐。對伴侶大方當然是好的，但是當你認為用錢就可以打動對方的時候，你和另一半 的感情就會淪為一種物質上的交換。尋找一個同樣樂衷於財富，能幫助你更上層樓的伴侶是對的，但是兩人如果有更多知性的分享，你們的生活可以更契合而滿足。
            
            生命數字8的人的職業:
            充滿了成就動機，一心想賺大錢的你，一旦時機成熟可以自己創業當老闆。但是學會變得實際而務實對你而言是很重要的。另外，對於投資理財有高度興趣的你，也很適合從事財務金融方面的工作，如股票、銀行、金控等。如果你很渴望權力，走上政治，當民意代表也適合你的屬性。另外，在企業界擔任財務方面的工作，也是你的選擇之一。
            """
            
        case.nine:
            return """
            生命數字9的人的性格:
            你的個性比恬淡出世，有點孤獨喜歡獨處，甚至有點孤僻，喜歡獨來獨往，不喜歡複雜的人際關係。你對於宗教靈性的事物會感到高度的興趣。你同時也是個夢想家，是個理想主義者，重視精神的層次，而對於現實生活中，材米油鹽的事感到俗氣而忽視。另外，你還對人有一種悲憫的情懷，想要去幫助別人，也對神秘學充滿了好奇及求知的欲望。
            
            生命數字9的人的缺點:
            孤獨難相處有時候可是你的正字商標！你常常想要一個人獨處，並把自己藏起來，對很多事物似乎都提不太起興趣，所以你有時候會有一種沒什麼值得追求，而有一種載浮載沈的感覺。不務實不實際，腦子裡充滿了各種空想，是你會遇見的問題，關於這些人生的疑問，如果你能以積極的在宗教靈性的領域來尋求解答，你就能以一種超然的方式來看待自己的人生。
            
            生命數字9的人的愛情:
            你在感情的部份比較被動，而且因為不擅長拒絕別人，所以一旦有人追求你，你也會很自然的就跟對方在一起。也無所謂愛不愛，但仍然保持著一種孤獨而疏離的相處方式，另一半也很難真的了解你在想什麼，如果你的另一半也對神秘學宗教方面有興趣，那你們就會有很多共同的話題。你需要慎選你的伴侶，因為當他不夠負責且不成熟時候，你可會有很多苦頭吃。
            
            生命數字9的人的職業:
            對於宗教神秘學的興趣，會讓你有機會從事與宗教有關的工作。對人的慈悲與愛，會讓你有機會走入為他人服務的慈善機構，或非營利組織。你通常喜歡一個人思考一個人工作，所以像教師、研究員的工作也適合你。很多9數的人，做什麼工作好像也不那麼重要，但是如果能去做一些義工，或助人的工作，都會讓你內心得到平靜。
            """
            
        }
    }
}
